# 从文件读取数据要将字符串转换成数字类型,万物都能是字符串，但是要转数字必须要求内容都是数字
# input输入语句默认结果为字符串类型，若需要数字类型进行类型转换
# 常见的转换语句：int(x) 转换为整数类型
# 常见的转换语句：float(x) 转换为浮点类型
# 常见的转换语句：str(x) 转换为字符串类型

# 将数字类型转换为字符串类型
a = 100
b = str(a)
print(type(b), "变量a = 100的值为：", b)

# 将字符串类型转换为整数类型
c = "10086"
d = int(c)
print(type(d), "字符串c = 10086的值为：", d)

# 将字符串类型转换为浮点数类型
e = "100.10"
f = float(e)
print(type(f), "字符串e = 100.10的值为：", f)

# 将整数类型转换为浮点数类型
g = 10086
h = float(g)
print(type(h), "g = 10086的值为：", h)

# 将浮点类型转换为整数类型，丢失小数部分的精度
i = 100.50
j = int(i)
print(type(j), "i = 100.50的值为：", j)
