"""
    需求分析：有一份账单文件，记录了消费收入的具体记录，内容如下：
    name, date, money, type, remarks
    周杰轮,2022-01-01,100000,消费,正式
    周杰轮,2022-01-02,300000,收入,正式
    周杰轮,2022-01-03,100000,消费,测试
    林俊节,2022-01-01,300000,收入,正式
    林俊节,2022-01-02,100000,消费,测试
    林俊节,2022-01-03,100000,消费,正式
    林俊节,2022-01-04,100000,消费,测试
    林俊节,2022-01-05,500000,收入,正式
    张学油,2022-01-01,100000,消费,正式
    张学油,2022-01-02,500000,收入,正式
    张学油,2022-01-03,900000,收入,测试
    王力鸿,2022-01-01,500000,消费,正式
    王力鸿,2022-01-02,300000,消费,测试
    王力鸿,2022-01-03,950000,收入,正式
    刘德滑,2022-01-01,300000,消费,测试
    刘德滑,2022-01-02,100000,消费,正式
    刘德滑,2022-01-03,300000,消费,正式
    要求：
        1.读取文件
        2.将文件写出到bill.txt.bak文件作为备份
        3.同时，将文件内标记为测试的数据行丢弃
    实现思路：
        1.open 和 r 模式打开一个文件对象，并读取文件
        2.open 和 w 模式打开另一个文件对象，用于文件写出
        3.for 循环内容，判断是否是测试，不是测试就wire写出，是测试就continue
        4.将2个文件均close()
"""
f = open("E:/project/bill.txt", "r", encoding="utf-8")
f_new = open("E:/project/bill.txt.bak", "w", encoding="utf-8")
for line in f:
    if "测试" in line:
        continue
    else:
        f_new.write(line)
f.close()
f_new.close()
