# 通过key找出对应的value
# 字典的定义使用大括号{}，不过存储元素是一个一个的：键值对
dict0 = {"张贺文": 18, "邢玮": 19, "范家康": 20}
print(f"dict是：{dict0},它的类型是：{type(dict0)}")

# 定义空的字典
dict1 = {}
dict2 = dict()
print(f"dict1是：{dict1},它的类型是：{type(dict1)}")
print(f"dict2是：{dict2},它的类型是：{type(dict2)}")

# 定义重复key的字典：新的会把老的覆盖掉
# dict0 = {"张贺文": 19, "张贺文": 18, "范家康": 20}
# print(f"张贺文的年龄是：{dict0['张贺文']},它的类型是：{type(dict0['张贺文'])}")

# 字典数据的获取
# 语法：字典[key]可以取到对应的value
dict0 = {"张贺文": 18, "邢玮": 19, "范家康": 20}
print(f"张贺文的年龄是：{dict0['张贺文']},它的类型是：{type(dict0['张贺文'])}")

# 字典的嵌套
a = {"语文": 77, "数学": 66, "英语": 33}
b = {"语文": 88, "数学": 86, "英语": 55}
c = {"语文": 99, "数学": 96, "英语": 66}
dict3 = {"王力宏": a, "周杰伦": b, "林俊杰": c}
print(dict3)
# 获取嵌套字典里的数据
dict_jay = dict3["周杰伦"]["语文"]
print(f"周杰伦的语文成绩为：{dict_jay}")
